### `iterating_over_the_rows_in_dataframe_when_vectorization_is_better_option`

In [1]:
import pandas as pd

In [2]:
# dictionary data

data = {
    'Year': [1980, 1990, 2010, 2020, 2022],
    'Time': [11.49, 08.61, 11.49, 09.64, 13.65],
    'Athlete': ['Shelly-Ann Fraser-Pryce', 'Elaine Thompson-Herah', 'Florence Griffith-Joyner', 'Carmelita Jeter', 'Marion Jones'],
    'Place': ['Jamaica', 'Jamaica', 'United States', 'United States', 'United States']
}

In [3]:
# Creating the dataframe using dictionary data

df = pd.DataFrame(data)

In [4]:
df

   Year   Time                   Athlete          Place
0  1980  11.49   Shelly-Ann Fraser-Pryce        Jamaica
1  1990   8.61     Elaine Thompson-Herah        Jamaica
2  2010  11.49  Florence Griffith-Joyner  United States
3  2020   9.64           Carmelita Jeter  United States
4  2022  13.65              Marion Jones  United States

### `Best way: Vectorization technique`

In [5]:
df['is_recent'] = df['Year'] > 2000

In [6]:
df

   Year   Time                   Athlete          Place  is_recent
0  1980  11.49   Shelly-Ann Fraser-Pryce        Jamaica      False
1  1990   8.61     Elaine Thompson-Herah        Jamaica      False
2  2010  11.49  Florence Griffith-Joyner  United States       True
3  2020   9.64           Carmelita Jeter  United States       True
4  2022  13.65              Marion Jones  United States       True

### `Alternative way:  Iterating over the rows in dataframe`

In [7]:
for i, row in df.iterrows():
    if row['Year'] > 2000:
        df.loc[i, 'is_recent'] = True
    else:
        df.loc[i, 'is_recent'] = False

In [8]:
df

   Year   Time                   Athlete          Place  is_recent
0  1980  11.49   Shelly-Ann Fraser-Pryce        Jamaica      False
1  1990   8.61     Elaine Thompson-Herah        Jamaica      False
2  2010  11.49  Florence Griffith-Joyner  United States       True
3  2020   9.64           Carmelita Jeter  United States       True
4  2022  13.65              Marion Jones  United States       True